==========
Paragraphs
==========

Hello, I'm a reStructuredText file.

I'm another paragraph

-I'm not a list

*I'm not a list or strong emphasis.

---

(document
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph))

===========
Blank lines
===========

One
                two
three

This has spaces below on purpose
          
This has spaces above on purpose

---

(document
  (paragraph)
  (paragraph)
  (paragraph))

============
Bullet lists
============

- One
- Two
- Three

|

+ Another
* Other one

|

+ Just me

---

(document
  (bullet_list
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph)))
  (paragraph)
  (bullet_list
    (list_item
      (paragraph))
    (list_item
      (paragraph)))
  (paragraph)
  (bullet_list
    (list_item
      (paragraph))))

================
Enumerated lists
================

1. One
2. Two
3. Three

|

#. One
#. Two

|

10. One
11. Two
I. Three
V. Four
a. Five
Z. Six

|

(#) one
(2) two
(III) three
(f) four

---

(document
  (enumerated_list
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph)))
  (paragraph)
  (enumerated_list
    (list_item
      (paragraph))
    (list_item
      (paragraph)))
  (paragraph)
  (enumerated_list
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph)))
  (paragraph)
  (enumerated_list
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph))
    (list_item
      (paragraph))))

==============
Literal blocks
==============

This is a typical paragraph. An indented literal block follows.

::

    for a in [5,4,3,2,1]:   # this is program code, shown as-is
        print a
    print "it's..."
    # a literal block continues until the indentation ends

Ordinary paragraph.

Another indented block::

 I'm the content

Another indented block: ::

                I'm the content

indented block?::
    
    Indented
 Still indented

---

(document
  (paragraph)
  (literal_block)
  (paragraph)
  (paragraph)
  (literal_block)
  (paragraph)
  (literal_block))

=========
Footnotes
=========

.. [1] Body elements go here.
.. [#] Body elements go here.
.. [#foo] Body elements go here.
.. [#another_label] Body elements go here.
.. [*] Body elements go here.

.. [*] I'm a footnote
   too.

.. [*]
   I'm a footnote *too*.

---

(document
  (footnote
    (label)
    (paragraph))
  (footnote
    (label)
    (paragraph))
  (footnote
    (label)
    (paragraph))
  (footnote
    (label)
    (paragraph))
  (footnote
    (label)
    (paragraph))
  (footnote
    (label)
    (paragraph))
  (footnote
    (label)
    (paragraph
      (emphasis))))

=========
Citations
=========

.. [2c] Citation `with` body elements.
.. [CIT2002] This is the citation.  It's just like a footnote.
.. [foo-bar] This is the citation.  It's just like a footnote.
.. [foo_bar] This is the citation.  It's just like a footnote.
.. [foo.bar] This is the citation.  It's just like a footnote.

.. [foo.bar] This is the citation.
   I's just like a footnote.

.. [foo.bar] This is the citation.
   **I's just like a footnote**

---

(document
  (citation
    (label)
    (paragraph
      (interpreted_text)))
  (citation
    (label)
    (paragraph))
  (citation
    (label)
    (paragraph))
  (citation
    (label)
    (paragraph))
  (citation
    (label)
    (paragraph))
  (citation
    (label)
    (paragraph))
  (citation
    (label)
    (paragraph
      (strong))))

=================
Hyperlink targets
=================

.. _hyperlink-name: link-block
.. _hyperlink_name: link-block

.. _hyperlink?name: link-block
.. _`_hyperlink: name`: link-block

.. _hyperlink-one:
.. _hyperlink-two:

.. __: anonymous
.. __:

---

(document
  (target
    (reference)
    (link))
  (target
    (reference)
    (link))
  (target
    (reference)
    (link))
  (target
    (reference)
    (link))
  (target
    (reference))
  (target
    (reference))
  (target
    (reference)
    (link))
  (target
    (reference)))

===========================
Anonymous hyperlink targets
===========================

__ foo
__ I'm anonymous

__ Bar
__

__


---

(document
  (target
    (link))
  (target
    (link))
  (target
    (link))
  (target)
  (target))

==========
Directives
==========

.. note::

.. image:: mylogo.jpeg

.. note:: This is a paragraph
.. warning:: Modify at your own risk!

.. note::
  
   This is a paragraph

.. note::
  
   - a
   - b

.. note:: **Warning!**
  
   Just joking...

---

(document
  (directive
    (type))
  (directive
    (type)
    (paragraph))
  (directive
    (type)
    (paragraph))
  (directive
    (type)
    (paragraph))
  (directive
    (type)
    (paragraph))
  (directive
    (type)
    (bullet_list
      (list_item
        (paragraph))
      (list_item
        (paragraph))))
  (directive
    (type)
    (paragraph
      (strong))
    (paragraph)))

========================
Substitution definitions
========================

.. |reST| replace:: reStructuredText

.. |biohazard| image:: biohazard.png
.. |bio-hazard| image:: biohazard.png

.. |bio hazard| image:: biohazard.png
.. |bio|hazard| image:: biohazard.png

.. |my-image| image:: /images/spade.png
   :height: 11
   :width: 11

---

(document
  (substitution_definition
    (substitution)
    (directive
      (type)
      (paragraph)))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (paragraph)))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (paragraph)))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (paragraph)))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (paragraph)))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (paragraph))))

========
Comments
========

.. This is a comment
.. []
.. [a--b]
.. [-a]
.. [-1]
.. [*]foo
.. [#]foo
.. [a]foo
.. [1]foo

.. I'm anothe comment
.. Me too

.. I'm a
   **multiline** comment.

..    I'm *another*
      multiline comment.

..

---

(document
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph))
  (comment
    (paragraph
      (strong)))
  (comment
    (paragraph
      (emphasis)))
  (comment))
