==========
Paragraphs
==========

Hello, I'm a reStructuredText file.

I'm another paragraph

-I'm not a list

*I'm not a list or strong emphasis.

(fg_*ff*)

---

(document
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph))

===========
Blank lines
===========

One
                two
three

This has spaces below on purpose
          
This has spaces above on purpose

---

(document
  (paragraph)
  (paragraph)
  (paragraph))

============
Bullet lists
============

- One
- Two
- Three

|

+ Another
* Other one

|

+ Just me

---

(document
  (bullet_list
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph))))
  (line_block
    (line))
  (bullet_list
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph))))
  (line_block
    (line))
  (bullet_list
    (list_item
      (body (paragraph)))))

================
Enumerated lists
================

1. One
2. Two
3. Three

|

#. One
#. Two

|

10. One
11. Two
I. Three
V. Four
a. Five
Z. Six

|

(#) one
(2) two
(III) three
(f) four

---

(document
  (enumerated_list
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph))))
  (line_block
    (line))
  (enumerated_list
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph))))
  (line_block
    (line))
  (enumerated_list
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph))))
  (line_block
    (line))
  (enumerated_list
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))
    (list_item
      (body (paragraph)))))

================
Definition lists
================

term 1 : bar
    Definition 1.
term 2 : foo
    Definition 2, paragraph 1.

    Definition 2, paragraph 2.
term 3 : classifier
    Definition 3.
term 4 : classifier one : classifier two
    Definition 4.

---

(document
  (definition_list
    (list_item
      (term)
      (classifier)
      (definition
        (paragraph)))
    (list_item
      (term)
      (classifier)
      (definition
        (paragraph)
        (paragraph)))
    (list_item
      (term)
      (classifier)
      (definition
        (paragraph)))
    (list_item
      (term)
      (classifier)
      (classifier)
      (definition
        (paragraph)))))

=======================
Indented literal blocks
=======================

This is a typical paragraph. An indented literal block follows.

::

    for a in [5,4,3,2,1]:   # this is program code, shown as-is
        print a
    print "it's..."
    # a literal block continues until the indentation ends

Ordinary paragraph.

Another indented block::

 > I'm the *content*
 I'm the *content*

Another indented block: ::

                I'm the content

indented block?::
    
    Indented
 Still indented

The following is a literal block::

    >>> This is not recognized as a doctest block by
    reStructuredText.  It *will* be recognized by the doctest
    module, though!

---

(document
  (paragraph)
  (literal_block)
  (paragraph)
  (paragraph
    (literal_block))
  (paragraph
    (literal_block))
  (paragraph
    (literal_block))
  (paragraph
    (literal_block)))

=====================
Quoted literal blocks
=====================

::

> lonely
> block

John Doe wrote::

>> Great idea!
>
> Why didn't I think of that?

You just did!  ;-)

Another indented block::

> I'm the content

Another indented block: ::

|               I'm the content

indented block?::
    
*   Indented
*
* Still indented


a::

* b
*a*:

---

(document
  (literal_block)
  (paragraph
   (literal_block))
  (paragraph)
  (paragraph
    (literal_block))
  (paragraph
    (literal_block))
  (paragraph
    (literal_block))
  (paragraph
    (literal_block)))

===========
Line blocks
===========

| Lend us a couple of bob till Thursday.
| I'm absolutely skint.
| But I'm expecting a postal order and I can pay you back
  as soon as it comes.
| Love, Ewan.

Take it away, Eric the Orchestra Leader!

| A one, two, a one two three four
|
| Half a bee, philosophically,
|     must, **ipso facto**, half not be.
| But half the bee has got to be,
|     *vis a vis* its entity.  D'you see?
|
| But can a bee be said to be
|     or not to be an entire bee,
|         when half the bee is not a bee,
|             due to some ancient injury?
|
| Singing...

And finally, an empty one:

|

---

(document
  (line_block
    (line)
    (line)
    (line)
    (line))
  (paragraph)
  (line_block
    (line)
    (line)
    (line)
    (line
      (strong))
    (line)
    (line
      (emphasis))
    (line)
    (line)
    (line)
    (line)
    (line)
    (line)
    (line))
  (paragraph)
  (line_block
    (line)))

============
Block quotes
============

  Can you quote me?

This is a great quote

    "It is my *business* to know things.  That is my trade."

    + A
    + B
    
    .. am i here?

    -- Sherlock Holmes

..

    "It is my *business* to know things.  That is my trade."

    -- Sherlock
       *Holmes*

..

  And This is a real em-dash:

  â€” the *m*-**dash**

---

(document
  (block_quote
    (paragraph))
  (paragraph)
  (block_quote
    (paragraph
      (emphasis))
    (bullet_list
      (list_item
       (body (paragraph)))
      (list_item
       (body (paragraph))))
    (comment)
    (attribution))
  (comment)
  (block_quote
    (paragraph
      (emphasis))
    (attribution
      (emphasis)))
  (comment)
  (block_quote
    (paragraph)
    (attribution
      (emphasis)
      (strong))))

==============
Doctest blocks
==============

This is an ordinary paragraph.

>>> print 'this is a Doctest block'
this is a Doctest block


>>>I'm a paragraph.

>>> print("hello")

>>> print("world")

---

(document
  (paragraph)
  (doctest_block)
  (paragraph)
  (doctest_block)
  (doctest_block))

=========
Footnotes
=========

.. [1] Body elements go here.
.. [#] Body elements go here.
.. [#foo] Body elements go here.
.. [#another_label] Body elements go here.
.. [*] Body elements go here.

.. [*] I'm a footnote
   too.

.. [*]
   I'm a footnote *too*.

---

(document
  (footnote
    (label)
    (body (paragraph)))
  (footnote
    (label)
    (body (paragraph)))
  (footnote
    (label)
    (body (paragraph)))
  (footnote
    (label)
    (body (paragraph)))
  (footnote
    (label)
    (body (paragraph)))
  (footnote
    (label)
    (body (paragraph)))
  (footnote
    (label)
    (body (paragraph (emphasis)))))

=========
Citations
=========

.. [2c] Citation `with` body elements.
.. [CIT2002] This is the citation.  It's just like a footnote.
.. [foo-bar] This is the citation.  It's just like a footnote.
.. [foo_bar] This is the citation.  It's just like a footnote.
.. [foo.bar] This is the citation.  It's just like a footnote.

.. [foo.bar] This is the citation.
   I's just like a footnote.

.. [foo.bar] This is the citation.
   **I's just like a footnote**

---

(document
  (citation
    (label)
    (body (paragraph (interpreted_text))))
  (citation
    (label)
    (body (paragraph)))
  (citation
    (label)
    (body (paragraph)))
  (citation
    (label)
    (body (paragraph)))
  (citation
    (label)
    (body (paragraph)))
  (citation
    (label)
    (body (paragraph)))
  (citation
    (label)
    (body (paragraph (strong)))))

=================
Hyperlink targets
=================

.. _hyperlink-name: link-block
.. _hyperlink_name: link-block

.. _hyperlink?name: link-block
.. _`_hyperlink: name`: link-block

.. _hyperlink-one:
.. _hyperlink-two:

.. __: anonymous
.. __:

---

(document
  (target
    (target)
    (link))
  (target
    (target)
    (link))
  (target
    (target)
    (link))
  (target
    (target)
    (link))
  (target
    (target))
  (target
    (target))
  (target
    (target)
    (link))
  (target
    (target)))

===========================
Anonymous hyperlink targets
===========================

__ foo
__ I'm anonymous

__ Bar
__

__


---

(document
  (target
    (link))
  (target
    (link))
  (target
    (link))
  (target)
  (target))

==========
Directives
==========

.. note::

.. image:: mylogo.jpeg

.. note:: This is a paragraph
.. warning:: Modify at your own risk!

.. note::

   This is a paragraph

.. note::

   - a
   - b

.. note:: **Warning!**

   Just joking...

---

(document
  (directive
    (type))
  (directive
    (type)
    (body (paragraph)))
  (directive
    (type)
    (body (paragraph)))
  (directive
    (type)
    (body (paragraph)))
  (directive
    (type)
    (body (paragraph)))
  (directive
    (type)
    (body
      (bullet_list
        (list_item
        (body (paragraph)))
        (list_item
        (body (paragraph))))))
  (directive
    (type)
    (body
      (paragraph
        (strong))
      (paragraph))))

========================
Substitution definitions
========================

.. |reST| replace:: reStructuredText

.. |biohazard| image:: biohazard.png
.. |bio-hazard| image:: biohazard.png

.. |bio hazard| image:: biohazard.png
.. |bio|hazard| image:: biohazard.png

.. |my-image| image:: /images/spade.png
   :height: 11
   :width: 11

---

(document
  (substitution_definition
    (substitution)
    (directive
      (type)
      (body (paragraph))))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (body (paragraph))))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (body (paragraph))))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (body (paragraph))))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (body (paragraph))))
  (substitution_definition
    (substitution)
    (directive
      (type)
      (body (paragraph)))))

========
Comments
========

.. This is a comment
.. []
.. [a--b]
.. [-a]
.. [-1]
.. [*]foo
.. [#]foo
.. [a]foo
.. [1]foo

.. I'm anothe comment
.. Me too

.. I'm a
   **multiline** comment.

..    I'm *another*
      multiline comment.

..
  I'm a comment

..

..
..

---

(document
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment))
